app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nome", "email", "nivel", "fone", "orient", "coorient", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["nome", ""], ["email", ""], ["nivel", ""], ["fone", ""], ["orient", ""], ["coorient", ""], ["created_at", "2015-12-13 18:39:04.357558"], ["updated_at", "2015-12-13 18:39:04.357558"]]

  def destroy
    @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 980190962]]